__rules = [
    "Правіла 1/4: Шыпячыя гукі перадаюцца пры дапамозе надрадковых “гачэкаў” у выглядзе птушачак "
    "ж – ž, ш – š, ч – č: žyta, šycht, čas.  Звярніце ўвагу на тое, што гук х перадаецца спалучэннем літар "
    "ch: chutka, chvilina. А літара h служыць для перадачы нашага фрыкатыўнага г: hety, hrošy.",
    "Правіла 2/4: Мяккасць зычных паказваецца пры дапамозе крэскі над літарай, якая выглядае як націск: loś, hraź, "
    "koń. Цікава, што мяккасць l перадаецца двума рознымі спосабамі. У афіцыйнай лацінцы, прынятай у 2007 годзе, "
    "мяккасць l перадаецца пры дапамозе крэскі над літарай: šyÍda, stoÍ. Таксама пашырана перадача l мяккага і "
    "цвёрдага на ўзор польскай мовы: мяккая літара l пішацца лацінкай без аніякіх дадатковых значкоў, а цвёрдая – "
    "перакрэсленая ł: šylda, stol, але stoł, łyžka.",
    "Правіла 3/4: Асаблівую ўвагу варта звярнуць на запіс лацінкай літар е, ё, ю, я. Пасля зычных яны перадаюцца пры "
    "дапамозе спалучэння галосных е, о, u, а з папярэднім і, напр.: lios, nie, ziamlia. У пачатку слова, пасля "
    "галосных і раздзяляльнага мяккага знака ці апострафа – спалучэннем галосных е, o, u, a з папярэднім j, напр.: "
    "jon, maja, zjava.",
    "Правіла 4/4: Гукі дз і дж у лацінскім варыянце таксама ўяўляюць сабой спалучэнне дзвюх літар (дыграфы) dz і dž, "
    "а падоўжаны дз – спалучэнне трох літар ddz, напр.: dzie, chadžu, stahoddzie. Гук ў перадаецца пры дапамозе "
    "лацінскай ŭ з дужкай над ёй:  chadziŭ, poŭnia. Гук ы запісваецца лацінскай y: byŭ, myla."
]

__link = "Дарэчы, я вывучыў гэтыя правілы на сайце МоваНанова (і гэта нават не рэкляма!) " \
         "https://www.movananova.by/zaniatki/teoryya-i-praktyka-movy-asnounyya-pravily-belaruskaj-lacinki.html"


def get_rules():
    return __rules


def get_link():
    return __link